
&НаКлиенте
Процедура СгенерироватьКод(Команда)
	Сервис = ДанныеСервиса.Инициализация()
		.Имя("Test Swagger")
		.Описание("", ПолноеОписаниеСервиса())
		.Префикс("test/v1")
		.Версия("1.0")
		.Контакт("Авдеев Никита (NAvdeyev)", "", "navdeyev@kpmg.kz")
		.Тег("Простой", "Самый простой сервис")
		.Тег("Продвинутый", "Один сервис с двумя методами и параметрами")
		.Тег("Сложный", "Сложный сервис с параметрами и разными схемами");

	Начало = "Сервис = ДанныеСервиса.Инициализация()";
	
КонецПроцедуры
                             