#Область ПрограммныйИнтерфейс
Процедура УстановитьСтандартныйСерверИПорт(ОписаниеСервиса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	Справочник.ДанныеСервера КАК ДанныеСервераТ
		|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОписаниеСервиса.Сервер(Выборка.Наименование, Выборка.Описание);
		Если ЗначениеЗаполнено(Выборка.Логин) Тогда
			ОписаниеСервиса.ИмяПоУмолчанию(Выборка.Логин);			
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Порт) Тогда
			ОписаниеСервиса.ПортПоУмолчанию(Выборка.Порт);			
		КонецЕсли;
		
		ВыборкаЛогин = Выборка.Логины.Выбрать();
		Логины = Новый Массив;
		Пока ВыборкаЛогин.Следующий() Цикл
			Логины.Добавить(ВыборкаЛогин.Логин);		
		КонецЦикла;
		Если Логины.Количество() > 0 Тогда
			ОписаниеСервиса.ИменаПользователейСервера(СтрСоединить(Логины, ";"));
		КонецЕсли;
		
		ВыборкаПорт = Выборка.Порты.Выбрать();
		Порты = Новый Массив;
		Пока ВыборкаПорт.Следующий() Цикл
			Порты.Добавить(ВыборкаПорт.Порт);		
		КонецЦикла;
		Если Порты.Количество() > 0 Тогда
			ОписаниеСервиса.ПортыСервера(СтрСоединить(Порты, ";"));
		КонецЕсли;
	КонецЦикла;	

	ОписаниеСервиса.Безопасность("Basic")
		.БазоваяАвторизация("Basic");
	
	
КонецПроцедуры
#КонецОбласти