#Область ПрограммныйИнтерфейс
Функция Инициализация() Экспорт
	Обработка = Обработки.ДанныеСервисов.Создать();
	Возврат Обработка.Инициализация();
КонецФункции

Функция УстановитьДанныеСервиса(ВнешнийОбъект, ПараметрыВыполнения) Экспорт 
	Данные = ВнешнийОбъект.ОписаниеСервиса().ОписаниеСервиса;
	HTTPОтвет = Новый HTTPСервисОтвет(200); 
	HTTPОтвет.Заголовки.Вставить("Content-Type", "application/json");
	HTTPОтвет.УстановитьТелоИзСтроки(Данные); 
	ПараметрыВыполнения.РезультатВыполнения.Вставить("HTTPОтвет", HTTPОтвет);			
КонецФункции
#КонецОбласти