#Область ПрограммныйИнтерфейс
&Вместо("СведенияОВнешнейОбработке")
Функция uAPIСведенияОВнешнейОбработке(ВерсияБСП)
	ПараметрыРегистрации = ПродолжитьВызов(ВерсияБСП); 
	РеквизитыТабличнойЧасти = Метаданные.Справочники.ДополнительныеОтчетыИОбработки.ТабличныеЧасти.Команды.Реквизиты;	
	ПараметрыРегистрации.Команды.Колонки.Добавить("Метод", РеквизитыТабличнойЧасти.Метод.Тип);
	ПараметрыРегистрации.Команды.Колонки.Добавить("Префикс", РеквизитыТабличнойЧасти.Префикс.Тип);
	
	Возврат ПараметрыРегистрации;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&Вместо("ПолучитьВидОбработкиПоСтроковомуПредставлениюВида")
Функция uAPIПолучитьВидОбработкиПоСтроковомуПредставлениюВида(СтроковоеПредставление)
	Если СтроковоеПредставление = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиHTTPСервис() Тогда
		Возврат Перечисления.ВидыДополнительныхОтчетовИОбработок.HTTPСервис;	
	Иначе
		Возврат ПродолжитьВызов(СтроковоеПредставление);
	КонецЕсли;
КонецФункции

&Вместо("ВыполнитьКомандуВнешнегоОбъекта")
Функция uAPIВыполнитьКомандуВнешнегоОбъекта(ВнешнийОбъект, ИдентификаторКоманды, ПараметрыКоманды, АдресРезультата)
 	РезультатИзменен = Ложь;
	Результат = ПродолжитьВызов(ВнешнийОбъект, ИдентификаторКоманды, ПараметрыКоманды, АдресРезультата);  
	
	СведенияОВнешнемОбъекте = ВнешнийОбъект.СведенияОВнешнейОбработке(); // см. СведенияОВнешнейОбработке
	
	ВидОбработки = ПолучитьВидОбработкиПоСтроковомуПредставлениюВида(СведенияОВнешнемОбъекте.Вид);
	
	ПередаватьПараметры = (
		СведенияОВнешнемОбъекте.Свойство("ВерсияБСП")
		И ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СведенияОВнешнемОбъекте.ВерсияБСП, "1.2.1.4") >= 0);
	
	РезультатВыполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыКоманды, "РезультатВыполнения");
	Если ТипЗнч(РезультатВыполнения) <> Тип("Структура") Тогда
		ПараметрыКоманды.Вставить("РезультатВыполнения", Новый Структура());
	КонецЕсли;

    Если ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.HTTPСервис Тогда  

		РезультатИзменен = Истина;
		
		Если ПараметрыКоманды.ЭтоЗапросДокументации Тогда
			ДанныеСервиса.УстановитьДанныеСервиса(ВнешнийОбъект, ПараметрыКоманды);
		Иначе
			ВыполнитьКомандуHTTPСервиса(
				ВнешнийОбъект,
				ИдентификаторКоманды,
				ПараметрыКоманды
			);
		КонецЕсли;

	КонецЕсли; 
	
	Если РезультатИзменен Тогда

		Если ТипЗнч(АдресРезультата) = Тип("Строка") И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			ПоместитьВоВременноеХранилище(ПараметрыКоманды.РезультатВыполнения, АдресРезультата);
		КонецЕсли; 
		
		Результат = ПараметрыКоманды.РезультатВыполнения;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции 

Процедура ВыполнитьКомандуHTTPСервиса(ВнешнийОбъект, Знач ИдентификаторКоманды, ПараметрыКоманды)
	Ответ = ВнешнийОбъект.ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды);
	ПараметрыКоманды.РезультатВыполнения.Вставить("HTTPОтвет", Ответ);
КонецПроцедуры  
#КонецОбласти