#Область ОбработчикиЭлементовШапки
&НаКлиенте
Асинх Процедура uAPIПубликацияПриИзмененииПосле(Элемент)
	Если Объект.Публикация = ПредопределенноеЗначение("Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.РежимОтладки") Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Заголовок = "Укажите каталог для сохранения файла отладки"; 
		Диалог.МножественныйВыбор = Ложь;
		Ответ = Ждать Диалог.ВыбратьАсинх();
		Если Ответ <> Неопределено Тогда
			Объект.ПутьДоФайла = Ответ[0];
			Адрес = ДополнительныеОтчетыИОбработкиВызовСервера.ПоместитьВХранилище(Объект.Ссылка, УникальныйИдентификатор);
			ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
			ПараметрыСохранения.Интерактивно = Ложь;
			ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, Адрес, Объект.ПутьДоФайла + "\" + Объект.ИмяФайла, ПараметрыСохранения);
		КонецЕсли;
	ИначеЕсли Публикация <> ПредопределенноеЗначение("Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.РежимОтладки") Тогда

	Иначе
		ТекстВопроса = "Обновить обработку из файла отладки?";
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Да, "Внимание!", КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ИмяФайла = Объект.ПутьДоФайла + "\" + Объект.ИмяФайла;
			ПараметрыРегистрации = Новый Структура;
			ПараметрыРегистрации.Вставить("Успех", Ложь);
			ПараметрыРегистрации.Вставить("АдресДанныхОбработки", АдресДанныхОбработки);
			Обработчик = Новый ОписаниеОповещения("ОбновитьИзФайлаПослеВыбораФайла", ЭтотОбъект, ПараметрыРегистрации);
			ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
			ПараметрыЗагрузки.Интерактивно = Ложь;
			ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
			ФайловаяСистемаКлиент.ЗагрузитьФайл(Обработчик, ПараметрыЗагрузки, Объект.ИмяФайла); 
			УдалитьФайлыАсинх(Объект.ПутьДоФайла, Объект.ИмяОбъекта + ".*");  
		КонецЕсли;
		Объект.ПутьДоФайла = "";	
	КонецЕсли;
	Публикация = Объект.Публикация;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаСервере
Процедура uAPIПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Публикация = Объект.Публикация;
КонецПроцедуры
#КонецОбласти
